app/controllers/hosts_controller.rb

SELECT "hosts".* FROM "hosts"
---
  def show
	@hosts = Host.all

SELECT  "hosts".* FROM "hosts"  WHERE "hosts"."id" = ? LIMIT 1  [["id", 298486374]]
---
  def detail
	@host = Host.find(params[:id])